# 定义字典
json = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    },
}

for key in json:
    # key为主键
    # map[key]获取key的值 然后[]获取item的某一个key的值

    if json[key]["级别"] == 1:
        json[key]["工资"] += 1000
        json[key]["级别"] += 1
    # 如果key为林俊杰直接部门改为CEO，工资改为99999，级别改为9
    if key == "林俊杰":
        json[key]["工资"] = 99999
        json[key]["级别"] = 9

print(json)
